In [26]:
import pandas as pd
from sqlalchemy import create_engine

In [27]:
engine = create_engine('mysql+mysqlconnector://root:password@localhost/sakila')

Code diatas digunakan untuk membuat koneksi antara sql dan python menggunakan library sqlalchemy

### Soal 1

In [28]:
pd.read_sql_query('''
SELECT title, category.name AS category, length FROM film
JOIN film_category
USING (film_id)
JOIN category
USING (category_id)
WHERE category.name LIKE '%Comedy%'
ORDER BY length ASC
LIMIT 10;
''', engine)

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

untuk nomer 1, kolom yang harus ditampilkan adalah title dan category dan durasi (length). untuk kolom title bisa di dapatkan di table film, sedangkan untuk category didapatkan di table category dengan kolom name. maka dari itu perlu dilakukan join karena berbeda table

sebelum bisa dilakukan join terhadap table kategori, table film harus terlebih dulu di gabungkan dengan table film_category, karena table film_category memiliki kolom category_id dan film_id sebagai foreign key

setelah ketiga table sudah saling terhubung dengan join, baru bisa dilakukan conditional selection dimana category.name harus Comedy dan diurutkan berdasarkan durasi tersingkat

### Soal 2

In [29]:
pd.read_sql_query('''
SELECT category.name AS kategori, COUNT(film_id) AS jumlahMovie, AVG(rental_rate) AS rataHargaSewa
FROM film
JOIN film_category
USING (film_id)
JOIN category
USING (category_id)
GROUP BY category.name
ORDER BY COUNT(film_id) DESC;
''', engine)

       kategori  jumlahMovie  rataHargaSewa
0        Sports           74       3.125135
1       Foreign           73       3.099589
2        Family           69       2.758116
3   Documentary           68       2.666471
4     Animation           66       2.808182
5        Action           64       2.646250
6           New           63       3.116984
7         Drama           62       3.022258
8         Games           61       3.252295
9        Sci-Fi           61       3.219508
10     Children           60       2.890000
11       Comedy           58       3.162414
12     Classics           57       2.744386
13       Travel           57       3.235614
14       Horror           56       3.025714
15        Music           51       2.950784

untuk soal nomor 2, kolom yang ditampilkan adalah kategori, jumlahMovie (jumlah film_id menggunakan aggregate function COUNT saat dilakukan GROUP BY) dan rataHargaSewa

lalu dilakukan join pada table film, film_category dan film_category

setelah ketiga table tersebut tergabung, dilakukan GROUP by pada kolom category.name yang diurutkan berdasarkan jumlahMovie dan diurutkan secara descending

### Soal 3

In [30]:
pd.read_sql_query('''
SELECT actor_id, first_name, last_name, COUNT(film_id) AS jumlah_Movie FROM actor
JOIN film_actor USING (actor_id)
GROUP BY actor_id
ORDER BY COUNT(film_id) DESC
LIMIT 10;
''', engine)

   actor_id first_name  last_name  jumlah_Movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

untuk nomor 3, kolom yang perlu ditampilkan adalah actor_id, first_name, dan last_name yang berada di table actor. setelah itu jumlah_movie yang merupakan perhitungan tiap element kolom film_id dari table film

dilakukan join terhadap 3 table yaitu table actor, table film_actor (karena memiliki film_id dan actor_id sebagai foreign key) dan film

dilakukan grouping berdasarkan actor_id dan diurutkan secara descending berdasarkan jumlah_Movie (merupakan film_id yang diberi fungsi aggregate COUNT) dan diberikan limi 10

### Soal 4

In [31]:
pd.read_sql_query('''
SELECT category.name AS category, COUNT(film_actor.film_id) AS jumlah_Movie
FROM actor
JOIN film_actor USING (actor_id)
JOIN film_category USING (film_id)
JOIN category USING (category_id)
WHERE first_name LIKE '%Gina%' AND last_name LIKE '%Degeneres'
GROUP BY category.name
''', engine)

       category  jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

untuk nomor 4, kolom yang digunakan adalah name dari table category dan jumlah_Movie (film_id dengan aggregate COUNT) dari table film_actor

dilakukan join terhadap table actor, film_actor, film_category dan category

setelah itu dilakukan conditional selection dimana nama harus sesuai dengan Gina Degeneres (first_name, last_name) dan di grouping berdasarkan category.name

### Soal 5

In [32]:
pd.read_sql_query('''
SELECT title, category.name AS category
FROM actor
JOIN film_actor USING (actor_id)
JOIN film USING (film_id)
JOIN film_category USING (film_id)
JOIN category USING (category_id)
WHERE first_name LIKE '%Gina%' AND last_name LIKE '%Degeneres' AND category.name LIKE '%Sci-Fi%'
''', engine)

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi

untuk soal nomor 5, kolom yang digunakan adalah title dari table film dan category (name) dari table category

dilakukan join terhadap table actor, film_actor, film_category dan category

conditional selection sama seperti nomor 4 namun ditambah dengan category.name Sci-Fi